site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

** DONE Deploying Hugo site on GitHub Pages :github:hugo:
CLOSED: [2023-01-04 Wed 19:53]
:PROPERTIES:
:EXPORT_FILE_NAME: deploying-hugo-site-on-github-pages
:END:
There is an excellent [[https://github.com/benmatselby/hugo-deploy-gh-pages][GitHub Action to build and deploy a Hugo site to GitHub
Pages]] by [[https://github.com/benmatselby][Ben Selby]].

But, the problem is that the action requires [[https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token][Personal Access Token]] to operate
which currently require classic token with a full access to all user repo. I'm
not comfortable with that.

Another issue, it seems that it is created to deploy to another git repo as it
nukes the target and retain only a single commit.

I will here describe a less intrusive way to post hugo site using GitHub Pages.
For this I created a
[[https://github.com/igordejanovic/hugo-deploy-gh-pages][modified version of
Ben's action]] just by removing all git related publishing code. The action now
merely downloads appropriate version of Hugo and do the build. The actual deploy
is handled by official GitHub actions.

Workflow script is in most part generated by going to =Settings->Pages= and
choosing =GitHub Actions= as source. There you have option to use Jekyll or deploy
static pages produced by other static site builder. Choose the later and you
will get the workflow config. There I just inserted a call to modified hugo
builder. As of this writing you will get a workflow similar to this:

#+begin_src yaml
# Simple workflow for deploying static content to GitHub Pages
name: Deploy static content to Pages

on:
  # Runs on pushes targeting the default branch
  push:
    branches: ["main"]

  # Allows you to run this workflow manually from the Actions tab
  workflow_dispatch:

# Sets permissions of the GITHUB_TOKEN to allow deployment to GitHub Pages
permissions:
  contents: read
  pages: write
  id-token: write

# Allow one concurrent deployment
concurrency:
  group: "pages"
  cancel-in-progress: true

jobs:
  # Single deploy job since we're just deploying
  deploy:
    environment:
      name: github-pages
      url: ${{ steps.deployment.outputs.page_url }}
    runs-on: ubuntu-latest
    steps:
      - name: Checkout
        uses: actions/checkout@v3
        with:
          submodules: true
      - name: Setup Pages
        uses: actions/configure-pages@v2
      - name: Hugo Deploy GitHub Pages
        uses: igordejanovic/hugo-deploy-gh-pages@main
        env:
          HUGO_VERSION: 0.105.0
      - name: Upload artifact
        uses: actions/upload-pages-artifact@v1
        with:
          path: 'public'
      - name: Deploy to GitHub Pages
        id: deployment
        uses: actions/deploy-pages@v1
#+end_src

Save this in =.github/workflow/build-site.yaml= in your Hugo git repo.

What this does is
1. Checkout the source of the site.
2. Do the setup.
3. Call Hugo builder action which downloads Hugo and build the static pages.
4. Upload =public= folder as a build artifact.
5. Deploy uploaded artifact as a new site.

This will keep site repo clean. No deployment branches (like =gh-pages=), no
=public= folder with built static pages etc. And, no need to setup and take care
of Private Access Tokens.

